{
    "chefsApp": {
        "info" : {
            "home":"Start",
            "beginning":{
                "menu":"Introduction",
                "chefs":{
                    "menu":"1. Chefs",
                    "intro":"<p>Chefs is a social network, focused on the field of cooking recipes.</p><p>Its goal is to enable users to share their cooking recipes with other users, and each brings its point of view to recipes.</p><p>As a bonus, it also offers the possibility of creating us our meal plans with recipes available in the application.</p>"
                },
                "sections":{
                    "menu":"2. Secciones",
                    "intro":"<p>This application is divided into different sections If we identify as a user, we will see in the top bar navigation different sections of the same</p><p>If you push on one of these sections shall we go away to the staff section of this section. This section will contain objects related to that related to us section.</p><p>For example, if we chop in section recipes, we will display information about the recipes we've created.</p>",
                    "info":"<p>The section in which we are now is a special section which explains how to use the application.</p><p>In this section of the application will find different chapters, with information relating to each of the main features of Chefs.</p><p>These chapters may contain sections and subsections on each of the characteristics and disaggregating the application on more specific sections.</p><p>To facilitate reading, these sections and its sub-sections can be open, and will appear at the top of a trail of bread crumbs that have open sections.</p>",
                    "nav-bar-img":"<div class=\"thumbnail col-sm-10\"><img src=\"assets/images/info/beginning/nav-bar.png\" alt=\"Navigation bar\"><div class=\"caption text-center\">Picture of the navigation bar in the information section.</div></div>"
                }
            },
            "user":{
                "menu":"Users",
                "beginning":"1. Introduction",
                "card":{
                    "menu":"1.1. Cards",
                    "intro":"On this site we can see the main user information on a card. These cards contain the following information:",
                    "img":"<b>Pictures:</b> Background images and profile that the user can upload from your device.",
                    "login":"<b>Login:</b> User login preceded by an @. This is the only and unchangeable identifier for this user.",
                    "name":"<b>Name:</b> Name the user has decided to. In principle this name is the same as the identifier until the user decides to change it.",
                    "description":"<b>Description:</b> This is an optional field where the user can put a brief description.",
                    "following":"<b>Following:</b> This field indicates the number of users below. This issue contains a link to the list of users itself. You can get more information in the section. ",
                    "followers":"<b>Followers:</b> This field is like field users who follows, but with followers. You can get more information in the section.",
                    "recipes":"<b>Recipes:</b> Contains the number of recipes unblocked user, as users followers and below, it contains a link to the recipes. We can learn more about the recipes in the chapter.",
                    "activities":"<b>Activities:</b> The icon <span class=\"glyphicon glyphicon-time\"></span> found at the end of the card, is a link to the list of activities performed by the user. We can get more information about activities in the chapter.",
                    "card-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/user/card-en.png\" alt=\"Card user\" class=\"img-rounded\"><div class=\"caption text-center\"><small>Image of a user card<small></div></div>"
                },
                "information":{
                    "menu":"1.2. Edit information",
                    "intro":"The user cards containing information about users. This section will discuss how to modify such information. If you want to know more about the card users visit subsection ",
                    "how":"To edit our information, simply head to any of our sections of the navigation bar. More information in paragraph ",
                    "how-do":"Once we are in the section, we must click on the icon <span class=\"glyphicon glyphicon-cog\"></span> can find at the top of our card. This will change our view of our card, and text fields will be converted into form fields and images can delete or edit them. The only field that can not edit is the <b>login</b>.",
                    "more":"<p>When we are in edit mode, the save button will not appear until we make any change. </p><p> We also observe that the edit icon has been modified by the icon<span class=\"glyphicon glyphicon-eye-open\"></span>. This icon allows us to visualize how will our card before storing. </p><p>When you change the view preview, if you've made any changes, the save button will remain, so that whether we like it has as been the card, just have to press the save button.</p>",
                    "card-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/user/card-edit-en.png\" alt=\"User card in edit mode\" class=\"img-rounded\"><div class=\"caption text-center\"><small>Image of a card user in edit mode</small></div></div>"
                },
                "following":{
                    "menu":"2. Following",
                    "info":"In this application we can follow users whose recipes we like more.",
                    "imply":"By following a user, we can see the recipes that the user is private. Besides its activities we appear in our list of activities, from the navigation bar.",
                    "about-recipe":"To learn more about recipes visit chapter ",
                    "about-activity":"To learn more about activities visit chapter ",
                    "follow":"<p>To follow a user, we must click on a button that appears at the top of your card, either in search or on your home page.</p><p>This button can appear in four states:</p>",
                    "btns":"<ul><li class=\"list-unstyled\"><img  src=\"assets/images/info/user/btn-follow-en.png\">Send request to follow.</li><li class=\"list-unstyled\"><img  src=\"assets/images/info/user/btn-waiting-en.png\"> Waiting to accept the request.</li><li class=\"list-unstyled\"><img  src=\"assets/images/info/user/btn-following-en.png\"> We follow that user.</li><li class=\"list-unstyled\"><img  src=\"assets/images/info/user/btn-locked-en.png\"> We have been locked by the user.</li></ul>",
                    "btn-info":"If you click on a button <em>follow</em>, this change to the state <em>waiting</em>. Once the user to see your request, it can perform the following actions: <b>Accept</b>, the button will change the state <em>Accepted</em>, <b>Locked</b>, the button will change the state <em>Locked</em>, <b>Ignore</b>, the button will return to <em>follow</em>.",
                    "btn-info-more":"If you press a button that is in the state <em>Following</em>, we will not follow that user.",
                    "list":"Finally, we can see the list of users who follow, clicking on the number of users who follow, which appears on our card."
                },
                "followers":{
                    "menu":"3. Followers",
                    "intro":"If we have good recipes, others will want to follow us, to see recipes that have hidden or see our actions.",
                    "info":"If a user has sent us a request that we have not answered, at logon we will appear next to the number of users who follow us from our card, the number of pending requests, something like this <small class=\"badge\">1</small>.",
                    "list":"<p>Clicking on the list of users who follow us, they appear both users who follow us, those who want us to go and we have locked.<p><p>On the card user to follow up button, three buttons that we will only appear in this list we appear. These three buttons are the three actions you can perform with a request, may accept it, Lock it or ignore it.</p>",
                    "actions":"<p>With these actions, the following will occur:</p><ul><li><b>Following:</b> The user will be your follower</li><li><b>Locked:</b> The user will be locked, and can no longer ask to be your follower.</li><li><b>Ignored:</b> The user will be ignored, will not follow, but will return to make another request tracking.</li></ul>",
                    "tool-img":"<div class=\"thumbnail col-sm-8\"><img src=\"assets/images/info/user/tool-follow-en.png\" alt=\"Action buttons\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Buttons image processing requests</small></figcaption></div>"
                }
            },
            "recipe":{
                "menu":"Recipes",
                "edit":{
                    "menu":"1. Edit recipe",
                    "general":{
                        "menu":"1.1. General information",
                        "info":"<p>Creating recipes can be made from any screen, whenever we are identified. This can make it through the creation module, with which you can create all kinds of objects. </p><p>This module provides the ability to create a recipe and can predefine the name, but not necessary.</p>",
                        "generator-img":"<div class=\"thumbnail col-sm-8\"><img src=\"assets/images/info/recipe/generator-en.png\" alt=\"Object creation module\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Image of object creation module</small></figcaption></div>",
                        "form":"<p>Once we meet on the form for creating the recipe, the general fields that we will be: </p><ul><li><b>Name: </b> This field is required in the will the our recipe name. </li> <li> <b> Image: </b> optional picture on our recipe. This image appears in the list of recipes. </li> <li> <b> Description: </b> Mandatory description of our recipe </li> <li> <b> URL Information: </b> In this field we can add a URL to a web where more details are given recipe. </li> <li> <b> Tip when cooking: </b> In this field we can put some trick to making the recipe </li> <li> <b> When you take?: </b> can put a time or a season for this dish </li> <li> <b> Tags: </b> You can add as many labels as you like to our recipe. This will help us find recipes in searches, and the list helps us get an idea of the recipe.</li></ul>",
                        "steps":"These are the general fields of a recipe, to learn more about how to add steps to see our recipe section "
                    },
                    "steps":{
                        "menu":"1.2. Steps of recipe",
                        "info":"<p>Creating a recipe may have steps. To add steps to a recipe, we in the central part of the form, a section dedicated to it. </p> <p> To add a new step, we must push the button to add step, this will add us block our section of steps.</p>",
                        "add-step-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/recipe/add-step-en.png\" alt=\"Add step\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Image creating a new step</small></figcaption></div>",
                        "create":"<p>Creating a step recipe is quite simple, all you must do after adding the step is to add the description of the step, and if we can add images or ingredients to our steps. </p> <p> To add ingredients just press the <span class = \"glyphicon glyphicon-pencil \"> </span>, this will add us a line ingredient, which features: <ul> <li> <b> Food: </b> food name to be added. In this box are appearing suggestions of foods that account application </li> <li> <b> Amount: </b> Number of the amount going to miss this food </li> <li> <b> Measurement: </b> a measure of the amount entered in the <em> number </em> field </li> <li> <b> Kcal per 100g:</b> kilocalories containing food per 100 grams thereof. This measure is optional and if she has auto-complete the first box, this box will also appear.</li></ul></p>",
                        "add-img":"<p>We can also add images to our steps, to better ilústralos performing step or to show how it would be. </p> <p> To add an image just press the button with the <span class = icon \"glyphicon glyphicon-picture \"> </span>. This will add us a picture in step, in which we drag our image or look.</p>",
                        "edit":"<p>Finally we also know that our steps can be moved or removed with icons <span class=\"glyphicon glyphicon-move\"></span> and <span class=\"glyphicon glyphicon-remove\" style=\"color: red;\"></span>.</p>"
                    }
                },
                "security":{
                    "menu":"2. Safety recipes",
                    "intro":"<p>All recipes have a configuration which we regard to safety. Tending each recipe a standalone configuration. </p> <p> This setting is changed in the security module that appears when you are editing or creating a recipe.</p>",
                    "security-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/recipe/security-en.png\" alt=\"Security module recipe\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Image of the security module of a recipe</small></figcaption></div>",
                    "info":"<p>Security configuration consists of three features: </p> <ul> <li> <b> Locked </b> If this property is enabled, only the owner can see and interact with the recipe. </li> <li> <b> Public: </b> If this property is activated, a user need not be your follower to see this recipe. </li> <li> <b> clonable: </b> This property specifies whether a user who has permission to view, I could clone this recipe </li> </ul> <p> From these properties always prevails. more restrictive. For example, if we activated the lock, no one can see or clone.Traductor de Google para empresas:Google Translator ToolkitTraductor de sitios webGlobal Market Finder</p>"
                },
                "list":{
                    "menu":"3. List of recipes",
                    "intro":"<p>When we look at the list of recipes, the list a card with information about each recipe list shown.</p>",
                    "card-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/recipe/card-en.png\" alt=\"Card of a recipe\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Image of a recipe card.</small></figcaption></div>",
                    "info":"<p>These cards are: </p> <ul> <li> The image of the recipe, if you have </li> <li> The name of the recipe </li> <li> The number of people.. who like, we can also add to our favorite recipes, if not already or delete if. This is known by the color of the heart, we like being red and black that is not on our list of favorites. </li> <li> The description. </li> <li> The number of steps and comments you have. </li> <li> Some of the tags it contains. </li> <li> The score measured card and ours, if available. This part as the favorite recipes is interactive.</li></ul>"
                }
            },
            "schedule":{
                "menu":"Plans",
                "general":{
                    "menu":"1.1. General information",
                    "intro":"<p>This application has available a section where we can create our meal planning with recipes available on the web. </p> <p> We can create us all the plans we want, these plans are completely private, and only the creator of the plan you can see it. </p> <p> The plans consist of a name and description, and a set of menus that we placed over a calendar for weeks. This calendar does not have dates, if not weeks, so you can make a plan at any time. </p> <p> The menus contain recipes and are defined for one day a week and one hour . These appear in the calendar as a yellow note where time and list of recipes appears as a link to the recipes that reference. </p> <p> When viewing the plans, we can do it horizontally or vertical with icons <span class = \"glyphicon glyphicon-th-list ng-scope \"> </span> and <span class = \"glyphicon glyphicon-th ng-scope \"> </span>, according the way we are</p>",
                    "schedule-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/schedule/schedule-en.png\" alt=\"Meal plan\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Image of a meal plan in portrait mode</small></figcaption></div>",
                    "pdf":"<p>Finally, there is also the possibility to print our plan in PDF format. This gives us the ability to print our plan in a simple way. To print, get the PDF, we just press the button that says \"<em> Create PDF </em> \" in red. </p> <p> When you press the button, we will download a PDF where availability (Vertical or Horizontal) depends on how we are currently viewing our planning.</p>"
                },
                "create":{
                    "menu":"1.2. Creating plans",
                    "intro":"<p>The creation of the plan, can be done from any screen, whenever we are identified. This can make it through the creation module, with which you can create all kinds of objects. </p> <p> This module provides the ability to create a plan can predefine the name, but not necessary.</p>",
                    "start":"<p>Once we have begun the creation of the plan, the first thing we must fill is the name of the plan and put a description. After entering this information will enable us start button.</p>",
                    "start-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/schedule/start-en.png\" alt=\"Start a plan\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Image start of a plan</small></figcaption></div>",
                    "started":"<p>Once you press start, the editing screen of plans, new apareciéndonos fields. </p> <p> These fields will be placed in calendar form for weeks, which can be placed horizontally or vertically, as we more comfortable will appear . </p> <p> this calendar can perform the following: </p> <ul> <li> <b> Add menu: </b> the blue buttons with a + allows us to add new menus to our plans. These menus are added to the day where the button you have pressed will find </li> <li> <b> Delete week or menu. </b> at the beginning of the week and cards menus, we appear the <span class = \"glyphicon glyphicon-trash \"> </span>, with which we can eliminate that week or that menu of our plan </li> <li> <b> Add new weeks. </b> This button is located at the end of the week, it is an orange button with a + inside. With we can add every week we want to our calendar </li> <li> <b> Edit menu. </b> We have the option to edit a menu already created with the <span class = icon \"glyphicon glyphicon -cog \"> </span> on the menu.</li></ul>",
                    "started-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/schedule/started-en.png\" alt=\"Edita a plan\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Image editing a plan</small></figcaption></div>",
                    "edit-menu":"<p>The menus are the meals we do daily. When we start or we edit a menu in we must specify the time of menu and recipes on the menu. </p> <p> To add recipes, we have a recipe finder, which is suggesting we prescriptions, as we write, when we have the desired recipe must only select and added to our menu. </p> <p> If we have added by mistake a wrong prescription, nothing happens with the <span class = icon \"glyphicon glyphicon-remove text -danger \"> </span> next to it can remove it from our menu.</p>",
                    "edit-menu-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/schedule/menu-en.png\" alt=\"Create or edit a menu\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Image editing or creating a menu</small></figcaption></div>",
                    "end":"<p>Once we have our plan, we just click on the finish button. If on the contrary we want to eliminate the recipe, will press the delete button</p>"
                }
            },
            "activities":{
                "menu":"Activities",
                "intro":"<p>On this site, we can see different lists of activities. Each item in this list contains a relevant activity has made a user with relevant information from such activity. <\p> <p> These listings are accessed with the <span class = \"glyphicon glyphicon-time \"> <\span>. There are two types of lists, the list of a user, this list we can see by clicking on the icon on the user card and displays only the activities of the user and the list of users you follow, this list we can see by clicking on the icon on the navigation bar and the activities of all users you follow are shown. <\p> <p> in all activities we find a link to the user that performed the action, a link to the element linked to the action, the action taken, summary, links to labels linked item and the date of the activity</p>",
                "list-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/activities/list-en.png\" alt=\"List of activities\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Picture of a list of activities</small></figcaption></div>"
            },
            "search":{
                "menu":"Búsquedas",
                "intro":"<p>Para buscar nuevas recetas o usuarios, disponemos de un buscador situado en la barra de navegación. Con  este buscador, podemos buscar tanto recetas, como usuarios o buscar etiquetas.</p><p>Por defecto, si empezamos a introducir letras, nos irá apareciendo recomendaciones  tanto para recetas, como para usuarios, como para etiquetas.</p><p>Si pulsamos el elemento de la recomendación, iremos directamente a dicho elemento. En caso de ser una etiqueta, aparecerán las recetas relacionadas con dicha etiqueta.</p>",
                "advice-img":"<div class=\"thumbnail col-sm-10\"><img src=\"assets/images/info/search/search-en.png\" alt=\"Recomendaciones\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen de las recomendaciones de una búsuqeda</small></figcaption></div>",
                "general":"<p>Si realizamos una búsqueda general puede ocurrir dos casos<p><ul><li>Encuentra elementos de solo un tipo, en este caso el listado de la búsqueda solo tendrá objetos de ese tipo</li><li>Encuentra elementos de varios tipos, en este caso el listado será mixto, mostrando elementos de todos los tipos encontrados</li></ul><p>En caso de no encontrar elementos de ningún tipo, nos aparecerá un mensaje advirtiéndonos de ello</p>",
                "specific":"<p>También podemos realizar búsqueda sobre un tipo de elementos específicos indicándolo con un carácter al principio de la búsqueda.</p><p>Los caracteres para las diferentes búsquedas son:</p><ul><li><b>&:</b> Recetas</li><li><b>@:</b> Usuarios</li><li><b>#:</b> Etiquetas</li></ul>"
            }

        }
    }
}
