{
    "chefsApp": {
        "info" : {
            "home":"Inicio",
            "beginning":{
                "menu":"Introducción",
                "chefs":{
                    "menu":"1. Chefs",
                    "intro":"<p>Chefs es una red social, enfocada al ámbito de las recetas de cocinas.</p><p>Su objetivo es que los usuarios puedan compartir sus recetas de cocinas con otros usuarios, y que cada uno aporte su punto de vista a las recetas.</p><p>Como extra, también nos ofrece la posibilidad de crearnos nuestros planes de comidas con las recetas disponibles en la aplicación.</p>"
                },
                "sections":{
                    "menu":"2. Secciones",
                    "intro":"<p>Esta aplicación esta divididas en diferentes secciones. Si nos identificamos como un usuario, veremos en la barra superior de navegación las diferentes secciones de la misma.</p><p>Si picamos sobre una de estas secciones nos iremos al apartado personal de dicha sección. Este apartado contendrá los objetos relacionados con dicha sección relacionados con nosotros.</p><p>Por ejemplo, si picamos en apartado de recetas, nos aparecerá información sobre las recetas que hemos creado.</p>",
                    "info":"<p>La sección en la que nos encontramos actualmente, es una sección especial en la cual se explica como utilizar la aplicación.</p><p>En esta sección de la aplicación encontrará diferentes capítulos, con información relacionada sobre cada una de las principales características de Chefs.</p><p>Estos capítulos pueden contener apartados y subapartados sobre cada una de las características, desglosando así la aplicación en apartados más específicos.</p><p>Para facilitar la lectura, estos apartados y sus subapartados, pueden ir abriéndose, y nos aparecerá en la parte superior un rastro de migas de pan de los apartados que tenemos abiertos.</p>",
                    "nav-bar-img":"<div class=\"thumbnail col-sm-10\"><img src=\"assets/images/info/beginning/nav-bar.png\" alt=\"Barra de navegación\"><div class=\"caption text-center\">Imagen de la barra de navegación, en la sección información.</div></div>"
                }
            },
            "user":{
                "menu":"Usuarios",
                "beginning":"1. Introducción",
                "card":{
                    "menu":"1.1. Tarjetas",
                    "intro":"En esta web podemos ver la información principal de los usuarios en una tarjeta. Estas tarjetas contienen la siguiente información:",
                    "img":"<b>Imagenes:</b> Imagen de fondo y de perfil que el usuario puede subir desde su dispositivo.",
                    "login":"<b>Login:</b> Login del usuario, precedido de una @. Éste es el identificador único e inmodificable de este usuario.",
                    "name":"<b>Nombre:</b> Nombre que el usuario se ha decidio dar. En principio este nombre es el mismo que el identificador, hasta que el usuario decida modificarlo.",
                    "description":"<b>Descripción:</b> Éste es un campo opcional, en el cual el usuario puede poner una breve descripción.",
                    "following":"<b>Siguiendo:</b> Este campo indica el número de usuarios a los que sigue. Este número contiene un enlace a la lista de los usuarios en si. Se puede obtener más información en el apartado ",
                    "followers":"<b>Seguidores:</b> Este campo es como el campo de los usuarios que sigue, pero con los seguidores. Se puede obtener más información en el apartado ",
                    "recipes":"<b>Recetas:</b> Contiene el número de recetas no bloqueadas del usuario, al igual que los seguidores y los usuarios que sigue, contiene un enlace hacia las recetas. Podemos obtener más información sobre las recetas en el capítulo",
                    "activities":"<b>Actividades:</b> El icono <span class=\"glyphicon glyphicon-time\"></span> que encontramos al final de la tarjeta, es un enlace al listado de las actividades realizadas por el usuario. Podemos obtener más información sobre las actividades en el capítulo",
                    "card-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/user/card-es.png\" alt=\"Tarjeta de usuario\" class=\"img-rounded\"><div class=\"caption text-center\"><small>Imagen de una tarjeta de usuario<small></div></div>"
                },
                "information":{
                    "menu":"1.2. Editar información",
                    "intro":"La tarjetas de usuarios contienen información sobre los usuarios. En esta sección se hablará sobre cómo modificar dicha información. Si quiere saber más sobre las tarjetas de usuarios visita la subsección ",
                    "how":"Para editar nuestra información, basta con dirigirnos a alguna de nuestras secciones de la barra de navegación. Más información en el apartado ",
                    "how-do":"Una vez estemos en la sección, debemos de pulsar sobre el icono <span class=\"glyphicon glyphicon-cog\"></span> que podemos encontrar en la parte superior de nuestra tarjeta. Esto nos modificará la vista de nuestra tarjeta, y los campos de textos se convertirán en campos de formularios y las imágenes podremos eliminarlas o editarlas. El único campo que no podremos editar es el <b>login</b>.",
                    "more":"<p>Cuando estemos en el modo edición, el botón de guardado no aparecerá hasta que realicemos algún cambio.</p><p>También observaremos que el icono de edición se ha modificado por el icono <span class=\"glyphicon glyphicon-eye-open\"></span>. Este icono nos permite visualizar como quedará nuestra tarjeta antes de guardarla.</p><p>Cuando cambiemos a la vista de previsualización, si hemos realizado algún cambio, el botón de guardado permanecerá, de manera que si nos gusta como ha quedado la tarjeta, solo tendremos que pulsar el botón de guardado.</p>",
                    "card-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/user/card-edit-es.png\" alt=\"Tarjeta de usuario en modo edición\" class=\"img-rounded\"><div class=\"caption text-center\"><small>Imagen de una tarjeta de usuario en modo edición</small></div></div>"
                },
                "following":{
                    "menu":"2. Siguiendo",
                    "info":"En esta aplicación podremos seguir a los usuarios cullas recetas nos gusten más.",
                    "imply":"Al seguir un usuario, podremos visualizar la recetas que dicho usuario tenga privadas. Además nos aparecerán sus actividades en nuestras lista de actividades, de la barra de navegación.",
                    "about-recipe":"Para saber más sobre las recetas visita el capítulo ",
                    "about-activity":"Para saber más sobre las actividades visita el capítulo ",
                    "follow":"<p>Para seguir a un usuario, debemos de pulsar sobre un botón que aparecerá en la parte superior de su tarjeta, ya sea en una búsqueda o en su página principal.</p><p>Este botón puede aparecer en cuatro estados:</p>",
                    "btns":"<ul><li class=\"list-unstyled\"><img  src=\"assets/images/info/user/btn-follow-es.png\"> Enviar petición para seguir.</li><li class=\"list-unstyled\"><img  src=\"assets/images/info/user/btn-waiting-es.png\"> Esperando que acepte la petición.</li><li class=\"list-unstyled\"><img  src=\"assets/images/info/user/btn-following-es.png\"> Seguimos a dicho usuario.</li><li class=\"list-unstyled\"><img  src=\"assets/images/info/user/btn-locked-es.png\"> El usuario nos ha bloqueado.</li></ul>",
                    "btn-info":"Si pulsamos en un botón <em>Seguir</em>, este cambiara al estado <em>Esperando</em>. Una vez el usuario vea su petición, este puede realizar las siguientes acciones: <b>Aceptarla</b>, el botón pasará al estado <em>Aceptada</em>, <b>Bloquearla</b>, el botón pasará al estado <em>Bloqueado</em>, <b>Ignorarla</b>, el botón volverá al estado <em>Seguir</em>.",
                    "btn-info-more":"Si pulsamos un botón que esta en el estado <em>Siguiendo</em>, dejaremos de seguir a dicho usuario",
                    "list":"Por último, podemos ver el listado de los usuarios a los que seguimos, pulsando en el número de usuarios que seguimos, que aparece en nuestra tarjeta."
                },
                "followers":{
                    "menu":"3. Seguidores",
                    "intro":"Si tenemos buenas recetas, otros usuarios  querrán seguirnos, para poder ver recetas que tengamos ocultas o ver nuestras acciones.",
                    "info":"Si un usuario nos ha enviado una petición que todavía no hemos contestado, al iniciar la sesión nos aparecerá junto al número de usuarios que nos siguen de nuestra tarjeta, el número de peticiones pendientes, algo como esto <small class=\"badge\">1</small>.",
                    "list":"<p>Al pulsar sobre la lista de los usuarios que nos siguen, aparecerán tanto los usuarios que nos siguen, los que nos quieren seguir y los que hemos bloqueado.<p><p>Sobre la tarjeta del usuario, encima del botón de seguir, nos aparecerán tres botones que solo nos aparecerán en este listado. Esos tres botones, son las tres acciones que podemos realizar con una petición, pudiendo Aceptarla, Bloquearla o Ignorarla.</p>",
                    "actions":"<p>Con estas acciones ocurrirá lo siguiente:</p><ul><li><b>Siguiendote:</b> El usuario será tu seguidor</li><li><b>Bloqueado:</b> El usuario pasará a estar bloqueado, y no podrá volver a pedirte ser tu seguidor</li><li><b>Ignorar:</b> El usuario será ignorado, no te seguirá, pero podrá volver a realizar otra petición de seguimiento</li></ul>",
                    "tool-img":"<div class=\"thumbnail col-sm-8\"><img src=\"assets/images/info/user/tool-follow-es.png\" alt=\"Botones de acción\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen de los botones de tratamiento de peticiones</small></figcaption></div>"
                }
            },
            "recipe":{
                "menu":"Recetas",
                "edit":{
                    "menu":"1. Edición de recetas",
                    "general":{
                        "menu":"1.1. Información general",
                        "info":"<p>La creación de recetas, se puede realizar desde cualquier pantalla, siempre que estemos identificados. Esto podemos hacerlo gracias al modulo de creación, con el cual se pueden crear todo tipos de objetos.</p><p>Este modulo nos proporciona la posibilidad de crear una receta, pudiendo definir previamente el nombre, aunque no es necesario.</p>",
                        "generator-img":"<div class=\"thumbnail col-sm-8\"><img src=\"assets/images/info/recipe/generator-es.png\" alt=\"Modulo de creación de objetos\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen del modulo de creación de objetos</small></figcaption></div>",
                        "form":"<p>Una vez nos encontremos en el formulario para la creación de la receta, los campos generales que nos encontraremos serán:</p><ul><li><b>Nombre :</b> Este campo es obligatorio, en el pondremos el nombre de nuestra receta. </li><li><b>Imagen :</b> Imagen opcional, sobre nuestra receta. Esta imagen aparecerá en el listado de las recetas. </li><li><b>Descripción :</b> Descripción obligatoria de nuestra receta.</li><li><b>Url de Información :</b> En este campo podremos poner una url hacía una web donde se den más detalles sobre la receta. </li><li><b> Sugerencia a la hora de cocinarlo :</b> En este campo podemos poner algún truco para la elaboración de la receta.</li><li><b>¿Cuando se lo tomaría :</b> Podemos poner un momento, o una temporada para realizar este plato.</li><li><b>Etiquetas :</b> Podemos añadir tantas etiquetas como queramos a nuestra receta. Esto nos ayudará a encontrarlo en búsquedas por recetas, y en el listado nos ayuda a tener una idea de la receta.</li></ul>",
                        "steps":"Estos son los campos generales de una receta, para saber más sobre como añadir pasos a nuestra receta mire la sección "
                    },
                    "steps":{
                        "menu":"1.2. Pasos de la receta",
                        "info":"<p>La creación de una receta puede tener pasos. Para añadir pasos a una receta, tenemos en la parte central del formulario, una sección dedicada a ello.</p><p> Para añadir un nuevo paso, solo debemos de pulsar el botón de añadir paso, esto nos añadirá un bloque a nuestra sección de pasos.</p>",
                        "add-step-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/recipe/add-step-es.png\" alt=\"Añadir paso\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen de la creación de un nuevo paso</small></figcaption></div>",
                        "create":"<p>La creación de un paso de receta es algo bastante sencillo, lo único que debemos de hacer tras añadir el paso es agregar la descripción del paso, y si queremos podemos añadir imágenes o ingredientes a nuestros pasos.</p><p>Para añadir ingredientes basta con pulsar el icono <span class=\"glyphicon glyphicon-pencil\"></span>, esto nos añadirá una linea de ingrediente, la cual cuenta con:<ul><li><b>Alimento :</b> Nombre del alimento que se añadirá. En esta casilla van apareciendo sugerencias de alimentos con los que cuenta la aplicación.</li><li><b>Cantidad :</b> Número de la cantidad que se va a echar de dicho alimento.</li><li><b>Medida :</b> Medida de la cantidad introducida en el campo <em>Cantidad</em>.</li><li><b>Kcal por 100g :</b> Kilocalorías que contiene el alimento por cada 100 gramos del mismo. Esta medida es opcional y en caso de haberse auto-completado la primera casilla, esta casilla también aparecerá.</li></ul></p>",
                        "add-img":"<p>También podemos añadir imágenes a nuestros pasos, para ilústralos mejor la realización del paso o para mostrar como quedaría.</p><p> Para añadir una imagen basta con pulsar el botón con el icono <span class=\"glyphicon glyphicon-picture\"></span>. Esto nos añadirá un cuadro en el paso, en el cual podremos arrastrar nuestra imagen o búscarla.</p>",
                        "edit":"<p>Por último también debemos de saber que nuestros pasos se pueden mover o eliminar con los iconos <span class=\"glyphicon glyphicon-move\"></span> y <span class=\"glyphicon glyphicon-remove\" style=\"color: red;\"></span> respectivamente.</p>"
                    }
                },
                "security":{
                    "menu":"2. Seguridad en recetas",
                    "intro":"<p>Todas las recetas que creemos tienen una configuración respecto a la seguridad. Tendiendo cada receta una configuración independiente.</p><p>Esta configuración se modifica en el modulo de seguridad que aparece cuando estamos editando o creando una receta.</p>",
                    "security-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/recipe/security-es.png\" alt=\"Modulo de seguridad de una receta\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen del modulo de seguridad de una receta</small></figcaption></div>",
                    "info":"<p>La configuración de seguridad consta de tres características:</p><ul><li><b>Bloqueada :</b> Si esta propiedad esta activa, solo el propietario puede ver e interactuar con la receta. </li><li><b>Pública :</b> Si esta propiedad esta activada, no es necesario que un usuario sea tu seguidor para poder ver dicha receta. </li><li><b>Clonable :</b> Esta propiedad especifica si un usuario que tenga permisos de visualización, pude clonar dicha receta.</li></ul><p>De estas propiedades siempre prevalece la más restrictiva. Por ejemplo, si tenemos activado el bloqueo, nadie podrá verla ni clonarla.</p>"
                },
                "list":{
                    "menu":"3. Listado de recetas",
                    "intro":"<p>Cuando listamos recetas, en el listado se muestra una tarjeta con información sobre la cada receta del listado.</p>",
                    "card-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/recipe/card-es.png\" alt=\"Tarjeta de una receta\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen de la tarjeta de una receta</small></figcaption></div>",
                    "info":"<p>En estas tarjetas encontramos:</p><ul><li>La imagen de la receta, si la tiene.</li><li>El nombre de la receta.</li><li>El número de personas a la que le gusta, además podemos añadirla a nuestras recetas favoritas, si no esta ya o eliminarla si esta. Esto se sabe con el color del corazón, siendo rojo que nos gusta y negro que no esta en nuestra lista de favoritas. </li><li>La descripción.</li><li>El número de pasos y comentarios que tiene.</li><li>Algunas de las etiquetas que contiene.</li><li>La puntuación medía de la tarjeta y la nuestra, si la tiene. Esta parte al igual que la de las recetas favoritas es interactiva.</li></ul>"
                }
            },
            "schedule":{
                "menu":"Planes",
                "general":{
                    "menu":"1.1. Información general",
                    "intro":"<p>Esta aplicación tiene disponible un apartado donde podremos crear nuestra planificación de comidas, con las recetas disponibles en la web.</p><p>Podemos crearnos todos los planes que queramos, estos planes, son totalmente privados, y solo el creador del plan puede verlo.</p><p>Los planes están compuestos por un nombre y descripción, y un conjunto de menús que vamos colocando a lo largo de un calendario por semanas. Este calendario no tiene fechas, si no unas semanas, por lo que se puede realizar un plan en cualquier momento.</p><p>Los menús, contienen las recetas y se definen para un día de una de las semanas y una hora. Estos aparecerán en el calendario como una nota amarilla, donde aparece la hora y el listado de las recetas, como enlace hacia las recetas que hacen referencia.</p><p>A la hora de visualizar los planes, podemos hacerlo de forma horizontal o vertical con los iconos <span class=\"glyphicon glyphicon-th-list ng-scope\"></span> y <span class=\"glyphicon glyphicon-th ng-scope\"></span>, según el modo en el que estemos</p>",
                    "schedule-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/schedule/schedule-es.png\" alt=\"Plan de comidas\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen de un plan de comidas en modo vertical</small></figcaption></div>",
                    "pdf":"<p>Por último, también esta la posibilidad de imprimir nuestro plan en formato PDF. Esto nos da la posibilidad de imprimir nuestro plan de una manera sencilla. Para imprimirlo, obtener el PDF, solo debemos de presionar el botón que pone \"<em>Crear PDF</em>\" en rojo.</p><p>Al presionar el botón, se nos descargará un PDF, donde su disponibilidad (Vertical u Horizontal) depende de como estemos viendo en ese momento nuestra planificación.</p>"
                },
                "create":{
                    "menu":"1.2. Creación de planes",
                    "intro":"<p>La creación del plan, se puede realizar desde cualquier pantalla, siempre que estemos identificados. Esto podemos hacerlo gracias al modulo de creación, con el cual se pueden crear todo tipos de objetos.</p><p>Este modulo nos proporciona la posibilidad de crear un plan, pudiendo definir previamente el nombre, aunque no es necesario.</p>",
                    "start":"<p>Una vez hayamos comenzado la creación del plan, lo primero que debemos de rellenar es el nombre del plan y poner una descripción. Una vez introducidos estos datos se nos habilitará el botón de empezar.</p>",
                    "start-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/schedule/start-es.png\" alt=\"Empezar un plan\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen del comienzo de un plan</small></figcaption></div>",
                    "started":"<p>Una vez pulsemos empezar, aparecerá la pantalla de edición de planes, apareciéndonos nuevos campos.</p><p>Estos campos estarán colocados en forma de calendario por semanas, el cual podremos colocar en horizontal o en vertical, según nos sea más cómodo.</p><p>Con este calendario podremos realizar las siguientes acciones:</p><ul><li><b>Añadir menús:</b> Los botones azules con un + nos permiten añadir nuevos menús a nuestros planes. Estos menús se añadirán al día donde se encuentre el botón que hemos pulsado.</li><li><b>Eliminar semana o menú:</b> Tanto al principio de la semana como en las tarjetas de los menús, nos aparecerá el icono <span class=\"glyphicon glyphicon-trash\"></span>, con el cual podremos eliminar dicha semana o dicho menú de nuestro plan.</li><li><b>Añadir nuevas semanas:</b> Este botón se encuentra al final de las semanas, es un botón naranja con un + en su interior. Con el podremos añadir todas las semanas que queramos a nuestro calendario.</li><li><b>Editar menús:</b> Tenemos la opción de editar un menú ya creado con el icono <span class=\"glyphicon glyphicon-cog\"></span> situado en dicho menú.</li></ul>",
                    "started-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/schedule/started-es.png\" alt=\"Editar un plan\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen de la edición de un plan</small></figcaption></div>",
                    "edit-menu":"<p>Los menús son las comidas que hacemos al día. Cuando empecemos o editemos un menú, en el debemos de especificar la hora del menú y las recetas del menú.</p><p>Para añadir recetas, tenemos un buscador de recetas, el cual nos va sugiriendo recetas, según vamos escribiendo, cuando tengamos la receta deseada solo debemos de seleccionarla y se añadirá a nuestro menú.</p><p>Si hemos añadido por equivocación una receta equivocada, no ocurre nada, con el icono <span class=\"glyphicon glyphicon-remove text-danger\"></span> situado junto a ella podemos eliminarlo de nuestro menú.</p>",
                    "edit-menu-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/schedule/menu-es.png\" alt=\"Crear o editar un menú\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen de la edición o creación de un menú</small></figcaption></div>",
                    "end":"<p>Una vez tengamos nuestro plan, solo debemos de pulsar sobre el botón finalizar. Si por lo contrario queremos eliminar la receta, pulsaremos el botón eliminar</p>"
                }
            },
            "activities":{
                "menu":"Actividades",
                "intro":"<p>En esta web, podemos ver diferentes listados de actividades. Cada elemento de este listado contiene una actividad relevante que ha realizado un usuario con la información relevante de dicha actividad.</p><p>A estos listados se acceden con el icono <span class=\"glyphicon glyphicon-time\"></span>. Hay dos tipos de listados, el listado de un usuario, este listado lo podemos ver pulsando en el icono de la tarjeta del usuario y solo muestra las actividades de dicho usuario y el listado de los usuarios que sigues, este listado lo podemos ver pulsando en el icono situado en la barra de navegación y en el se muestran las actividades de todos los usuarios que sigues.</p><p>En todas las actividades podremos encontrar un enlace al usuario que realizó dicho acción, un enlace al elemento vinculado a la acción, la acción realizada, un resumen, enlaces a las etiquetas del elemento vinculado y la fecha de la actividad</p>",
                "list-img":"<div class=\"thumbnail\"><img src=\"assets/images/info/activities/list-es.png\" alt=\"Listado de actividades\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen de un listado de actividades</small></figcaption></div>"
            },
            "search":{
                "menu":"Búsquedas",
                "intro":"<p>Para buscar nuevas recetas o usuarios, disponemos de un buscador situado en la barra de navegación. Con  este buscador, podemos buscar tanto recetas, como usuarios o buscar etiquetas.</p><p>Por defecto, si empezamos a introducir letras, nos irá apareciendo recomendaciones  tanto para recetas, como para usuarios, como para etiquetas.</p><p>Si pulsamos el elemento de la recomendación, iremos directamente a dicho elemento. En caso de ser una etiqueta, aparecerán las recetas relacionadas con dicha etiqueta.</p>",
                "advice-img":"<div class=\"thumbnail col-sm-10\"><img src=\"assets/images/info/search/search-es.png\" alt=\"Recomendaciones\" class=\"img-rounded\"><figcaption class=\"figure-caption\"><small>Imagen de las recomendaciones de una búsuqeda</small></figcaption></div>",
                "general":"<p>Si realizamos una búsqueda general puede ocurrir dos casos<p><ul><li>Encuentra elementos de solo un tipo, en este caso el listado de la búsqueda solo tendrá objetos de ese tipo</li><li>Encuentra elementos de varios tipos, en este caso el listado será mixto, mostrando elementos de todos los tipos encontrados</li></ul><p>En caso de no encontrar elementos de ningún tipo, nos aparecerá un mensaje advirtiéndonos de ello</p>",
                "specific":"<p>También podemos realizar búsqueda sobre un tipo de elementos específicos indicándolo con un carácter al principio de la búsqueda.</p><p>Los caracteres para las diferentes búsquedas son:</p><ul><li><b>&:</b> Recetas</li><li><b>@:</b> Usuarios</li><li><b>#:</b> Etiquetas</li></ul>"
            }

        }
    }
}
